zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_COMMON.h
  DSPI0_IRQn                   = 164,              /**< DSPI End of Queue Interrupt, DSPI Transmit FIFO Fill Interrupt, DSPI Command FIFO Fill Interrupt, DSPI Transfer Complete Interrupt, DSPI Command Transfer Complete Interrupt                                               , DSPI Command Transfer Complete Interrupt                                               , SPI Frame Transfer Complete Interrupt                                               , DSI Frame Transfer Complete Interrupt                                               , DSPI Transmit FIFO Invalid Write Flag                                               , DSPI Transmit FIFO Underflow Interrupt                                               , DSPI Receive FIFO Drain Interrupt                                               , DSPI Receive FIFO Overflow Interrupt                                               , DSPI Overrun (OR of ipi_int_tfuf and ipi_int_rfof)                                               , DSPI SPI frames Parity Error Interrupt                                               , DSPI DSI frames Parity Error Interrupt                                               , DSPI DSI frames Data Match Interrupt                                               , DSPI Global Interrupt (OR of all interrupt lines) */
  LPSPI0_IRQn                  = 165,              /**< LPSPI Interrupt */
  LPSPI1_IRQn                  = 166,              /**< LPSPI Interrupt */
  LPSPI2_IRQn                  = 167,              /**< LPSPI Interrupt */
  LPSPI3_IRQn                  = 168,              /**< LPSPI Interrupt */
  LPSPI4_IRQn                  = 169,              /**< LPSPI Interrupt */
  LPSPI5_IRQn                  = 170,              /**< LPSPI Interrupt */
  eTPU_B_CH14_IRQn             = 171,              /**< eTPU Engine A Channel 14 Interrup Status */
  eTPU_B_CH15_IRQn             = 172,              /**< eTPU Engine A Channel 15 Interrup Status */
  QSPI_IRQn                    = 173,              /**< TX Buffer Fill interrupt, Transfer Complete / Transaction Finished, RX Buffer Drain interrupt, Buffer Overflow / Underrun interrupt, Serial Flash Communication Error interrupt, All interrupts ORed output */
  eTPU_B_CH16_IRQn             = 174,              /**< eTPU Engine A Channel 16 Interrup Status */
  eTPU_B_CH17_IRQn             = 175,              /**< eTPU Engine A Channel 17 Interrup Status */
  eFlexPWM0_IRQn               = 176,              /**< fault interrupt, reload error interrupt */
  eFlexPWM1_IRQn               = 177,              /**< capture interrupt from submodule 0, compare interrupt from submodule 0, reload interrupt from submodule 0 */
  JDC_IRQn                     = 178,              /**< Indicates new data to be read from JIN_IPS register or can be written to JOUT_IPS register */
  SDADC_IRQn                   = 179,              /**< SD_ADC 0-3 interrupts */
  ADC0_IRQn                    = 180,              /**< End of conversion, Error interrupt, Watchdog interrupt */
  ADC1_IRQn                    = 181,              /**< End of conversion, Error interrupt, Watchdog interrupt */
  ADC2_IRQn                    = 182,              /**< End of conversion, Error interrupt, Watchdog interrupt */
  LPCMP0_IRQn                  = 183,              /**< Async interrupt */
  LPCMP1_IRQn                  = 184,              /**< Async interrupt */
  ADC3_IRQn                    = 185,              /**< End of conversion, Error interrupt, Watchdog interrupt */
  ADC4_IRQn                    = 186,              /**< End of conversion, Error interrupt, Watchdog interrupt */
  ADC5_IRQn                    = 187,              /**< End of conversion, Error interrupt, Watchdog interrupt */
  ADC6_IRQn                    = 188,              /**< End of conversion, Error interrupt, Watchdog interrupt */
  FCCU_0_IRQn                  = 189,              /**< Interrupt request(ALARM state) */
  FCCU_1_IRQn                  = 190,              /**< Interrupt request(miscellaneous conditions) */
  STCU_LBIST_MBIST_IRQn        = 191,              /**< Interrupt request(miscellaneous conditions) */
  HSE_MU0_TX_IRQn              = 192,              /**< ORed TX interrupt to MU-0 */
  HSE_MU0_RX_IRQn              = 193,              /**< ORed RX interrupt to MU-0 */
  HSE_MU0_ORED_IRQn            = 194,              /**< ORed general purpose interrupt request to MU-0 */
  HSE_MU1_TX_IRQn              = 195,              /**< ORed TX interrupt to MU-1 */
  HSE_MU1_RX_IRQn              = 196,              /**< ORed RX interrupt to MU-1 */
  HSE_MU1_ORED_IRQn            = 197,              /**< ORed general purpose interrupt request to MU-1 */
  eTPU_B_CH18_IRQn             = 198,              /**< eTPU Engine A Channel 18 Interrup Status */
  eTPU_B_CH19_IRQn             = 199,              /**< eTPU Engine A Channel 19 Interrup Status */
  eTPU_B_CH20_IRQn             = 200,              /**< eTPU Engine A Channel 20 Interrup Status */
  eTPU_B_CH21_IRQn             = 201,              /**< eTPU Engine A Channel 21 Interrup Status */
  MU_A_0_IRQn                  = 202,              /**< ORed TX interrupt to MUA */
  MU_A_1_IRQn                  = 203,              /**< ORed RX interrupt to MUA */
  MU_A_2_IRQn                  = 204,              /**< ORed general purpose interrupt request to MUA */
  MU_B_0_IRQn                  = 205,              /**< ORed TX interrupt to MUB */
  MU_B_1_IRQn                  = 206,              /**< ORed RX interrupt to MUB */
  MU_B_2_IRQn                  = 207,              /**< ORed general purpose interrupt request to MUB */
  Soc_RSB_IRQn                 = 212,              /**< PLL LOL interrupt */
  eFlexPWM1_1_IRQn             = 214,              /**< capture interrupt from submodule 1, compare interrupt from submodule 1, reload interrupt from submodule 1 */
  XRDC_IRQn                    = 216,              /**< XRDC Error Interrupt */
  CoolFlux1_IRQn               = 224,              /**< when dsp f/w encounters error during processing, o_core_trigger for safety */
  CoolFlux2_IRQn               = 225,              /**< o_core_trigger per thread */
  CoolFlux3_IRQn               = 226,              /**< o_core_trigger per thread */
  CoolFlux4_IRQn               = 227,              /**< o_core_trigger per thread */
  CoolFlux5_IRQn               = 228,              /**< o_core_trigger per thread */
  eTPU_B_CH22_IRQn             = 229,              /**< eTPU Engine A Channel 22 Interrup Status */
  eTPU_B_CH23_IRQn             = 230,              /**< eTPU Engine A Channel 23 Interrup Status */
  eTPU_B_CH24_IRQn             = 231,              /**< eTPU Engine A Channel 24 Interrup Status */
  SWG1_IRQn                    = 232,              /**< sgen_error */
  eTPU_B_CH25_IRQn             = 233,              /**< eTPU Engine A Channel 25-31 Interrup Status */
  eFlexPWM0_0_IRQn             = 234,              /**< capture interrupt from submodule 0, compare interrupt from submodule 0, reload interrupt from submodule 0 */
  eFlexPWM0_1_IRQn             = 235,              /**< capture interrupt from submodule 1, compare interrupt from submodule 1, reload interrupt from submodule 1 */
  eFlexPWM0_2_IRQn             = 236,              /**< capture interrupt from submodule 2, compare interrupt from submodule 2, reload interrupt from submodule 2 */
  eFlexPWM0_3_IRQn             = 237,              /**< capture interrupt from submodule 3, compare interrupt from submodule 3, reload interrupt from submodule 3 */
  eFlexPWM1_2_IRQn             = 238,              /**< capture interrupt from submodule 2, compare interrupt from submodule 2, reload interrupt from submodule 2 */
  eFlexPWM1_3_IRQn             = 239               /**< capture interrupt from submodule 3, compare interrupt from submodule 3, reload interrupt from submodule 3 */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M7 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M7 Core Configuration
 * @{
 */

#define __MPU_PRESENT                  1         /**< Defines if an MPU is present or not */
#define __ICACHE_PRESENT               1         /**< Defines if an ICACHE is present or not */
#define __DCACHE_PRESENT               1         /**< Defines if an DCACHE is present or not */
#define __DTCM_PRESENT                 1         /**< Defines if an DTCM is present or not */
#define __NVIC_PRIO_BITS               4         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */
#define __FPU_PRESENT                  1         /**< Defines if an FPU is present or not */


/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

/* No SDK compatibility issues. */

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* #if !defined(S32K39_COMMON_H_) */

